{
  "backend/main.mo": "Motoko canister managing contact messages, user profiles, and admin authorization using AccessControl with upgrade-safe admin persistence.",
  "feature_evidence.json": "Feature evidence report listing gradient‑text fixes in HeroSection and related files with associated components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend React components, hooks, sections, and Tailwind config files.",
  "frontend/index.css": "Base Tailwind CSS variables and theming for light/dark modes with OKLCH color tokens and global background/foreground styles.",
  "frontend/index.html": "HTML entry point configuring metadata, cache‑busting headers, fonts, and mounting the React root.",
  "frontend/scripts/generateCaffeineAdminToken.ts": "Node script generating a secure admin token for provisioning Messages page admin access via URL hash.",
  "frontend/src/App.tsx": "Main React app routing between homepage sections and the Messages page with gradient background layers and shared navbar/footer.",
  "frontend/src/components/Footer.tsx": "Simple footer with themed styling and caffeine.ai attribution.",
  "frontend/src/components/PortfolioNavbar.tsx": "Responsive navbar handling section scroll navigation, Messages routing, and Internet Identity login/logout state.",
  "frontend/src/components/SectionLayout.tsx": "Reusable section wrapper that renders optional titles/subtitles and children with layout classes.",
  "frontend/src/config/adminToken.ts": "Returns the admin token from env or a fallback hardcoded value for development.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and initializes access control via secret token.",
  "frontend/src/hooks/useActorWithAdminProvisioning.ts": "Creates a backend actor and attempts admin authorization using a session token, reloading when the token changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Queries backend to check if the current caller is recognized as an admin.",
  "frontend/src/hooks/useContactSubmit.ts": "Submits contact form messages through the actor with basic error normalization.",
  "frontend/src/hooks/useCountUpOnView.ts": "Animates counting up to a target value when the element becomes visible using IntersectionObserver.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading/storing identities and exposing login/logout state.",
  "frontend/src/hooks/useQueries.ts": "Fetches contact messages from the backend when enabled and allowed by admin status.",
  "frontend/src/index.css": "Tailwind base and custom theme variables for light/dark modes with gradient and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/MessagesPage.tsx": "Admin messages UI handling login, admin provisioning, remediation, and message fetching logic.",
  "frontend/src/sections/AboutSection.tsx": "Renders an About section with professional summary, education history, and career vision using cards and styled layout.",
  "frontend/src/sections/CertificationsSection.tsx": "Displays a single certification card within a styled section layout.",
  "frontend/src/sections/ContactSection.tsx": "Implements a contact form with validation, submission handling, error toasts, and contact detail links.",
  "frontend/src/sections/ExperienceSection.tsx": "Shows a timeline-style experience section with roles, dates, and achievements in card format.",
  "frontend/src/sections/HeroSection.tsx": "Builds a hero section with metrics, skills, background graphics, and resume download support.",
  "frontend/src/sections/ProjectsSection.tsx": "Presents featured projects with descriptions, highlights, tools, and icons in a grid layout.",
  "frontend/src/sections/SkillsSection.tsx": "Lists categorized technical skills using cards and badges within a structured section layout.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), store them in sessionStorage, retrieve them, and remove them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, fonts, and included plugins like typography and container queries.",
  "project_state.json": "Defines the project’s state, issues, and feature fixes related to invisible gradient text in the Hero section."
}