{
  "backend/main.mo": "Defines a contact message type, stores messages in a list, and exposes a submitMessage function that appends new messages with timestamps.",
  "feature_evidence.json": "Feature evidence report listing UI/theme-related features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling details of various frontend components, sections, hooks, and config files.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color variables, light/dark mode tokens, and global element styling.",
  "frontend/index.html": "HTML document setting up metadata, fonts, and the root element for loading the React app.",
  "frontend/src/App.tsx": "Main app component rendering navbar, all portfolio sections, gradient background shapes, footer, and toaster notifications.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution text with an accent-colored heart icon and link to caffeine.ai.",
  "frontend/src/components/PortfolioNavbar.tsx": "Responsive navbar with scroll-based active section tracking, smooth-scroll navigation, and a gradient-accent contact CTA.",
  "frontend/src/components/SectionLayout.tsx": "Reusable layout wrapper that applies consistent spacing, titles, subtitles, and container structure for sections.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useContactSubmit.ts": "Hook providing a submitMessage function that calls the backend actor and manages submission loading state.",
  "frontend/src/hooks/useCountUpOnView.ts": "Hook that animates a count-up effect when an element enters view using IntersectionObserver and easing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication using AuthClient, exposing identity state and login helpers.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing as React Query hooks aren't needed.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light and dark modes plus utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/sections/AboutSection.tsx": "Renders the About section with professional summary, education details, and career vision using styled cards.",
  "frontend/src/sections/CertificationsSection.tsx": "Displays a single certification card within a styled section layout.",
  "frontend/src/sections/ContactSection.tsx": "Implements a contact form with validation, submission via custom hook, and displays contact information links.",
  "frontend/src/sections/ExperienceSection.tsx": "Shows a timeline-style list of professional experiences with achievements using cards and badges.",
  "frontend/src/sections/HeroSection.tsx": "Renders the hero section with animated metrics, skill strip, scroll navigation, resume download logic, and layered gradient/dotted backgrounds.",
  "frontend/src/sections/ProjectsSection.tsx": "Displays featured analytics projects using cards with icons, descriptions, highlights, and tool badges.",
  "frontend/src/sections/SkillsSection.tsx": "Shows categorized skill groups using cards with icons and badges for technical abilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s redesign goals, constraints, known issues, and existing feature records for the portfolio site."
}