{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix HeroSection gradient text visibility for metrics and hero accents",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Correct Hero metrics numeric value styling so gradient-text values render visibly (no transparent text without a working gradient) across themes and breakpoints.",
      "acceptanceCriteria": [
        "In the Hero metrics grid, all four metric numeric values are visible in light mode and dark mode.",
        "Values remain visible across mobile, tablet, and desktop breakpoints.",
        "No metric value text uses `text-transparent` unless it also has a working gradient background applied (or an equivalent visible text color fallback)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Update the metric value element to use the existing `.gradient-accent` utility (instead of the invalid `bg-gradient-accent`) alongside `bg-clip-text text-transparent`, ensuring numeric values render visibly in all themes and breakpoints."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure other HeroSection gradient-text elements (tagline and floating 95% card) render visibly by using the existing `gradient-accent` utility or providing a compatible CSS alias for `bg-gradient-accent`.",
      "acceptanceCriteria": [
        "The Hero tagline text (“Turning data into actionable insights”) is visible.",
        "The floating overlay stat value (95%) is visible.",
        "No new console errors or Tailwind class resolution issues are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Replace `bg-gradient-accent` with the existing `gradient-accent` utility everywhere it is paired with `bg-clip-text text-transparent` (tagline and floating overlay 95% value) so these gradient-text elements render visibly."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a production-safe CSS utility alias for `.bg-gradient-accent` that applies the same gradient background as `.gradient-accent`, preventing any remaining uses of `bg-gradient-accent` from producing invisible text when combined with `bg-clip-text text-transparent`."
        }
      ]
    }
  ]
}